Repository: ajsazevedo/GenericApp
Catalog: GenericApp.Infra.CC.Localization/Resources/SharedResource.*.resx
Languages: es, pt_br

source: Access denied!
es: Acceso denegado!
pt_br: Acesso Negado!

# AlreadyRegistered
source: {0} already registered!
es: {0} ya registrado!
pt_br: {0} já possui cadastro!

# CannotConnectToDatabase
source: An error has occurred while establishing a connection to the database server.
es: Se produjo un error al conectarse al servidor de la base de datos.
pt_br: Ocorreu um erro enquanto estabelecia conexão ao servidor de banco de dados.

source: Cannot delete referenced record.
es: No es posible eliminar un registro referenciado.
pt_br: Não é possível deletar um registro referenciado.

source: Cannot insert duplicated row.
es: No es posible insertar una línea duplicada.
pt_br: Não é possível inserir uma linha duplicada.

# CannotMapNullDto
source: Dto to be mapped is null.
es: Dto que se asignará es nulo.
pt_br: Dto a ser mapeado esta nulo.

source: Could not deliver the e-mail.
es: No fue posible enviar el correo electrónico.
pt_br: Não foi possível enviar o e-mail.

# CouldNotFindAnImplementationForTheInterface
source: Could not find an implementation for the interface {0}.
es: No se pudo encontrar una implementación para la interfaz {0}.
pt_br: Não foi possível encontrar uma implementação para a interface {0}.

source: Couldn't connect to azure server.
es: No se puede conectar al servidor de Azure.
pt_br: Não foi possível se conectar ao servidor da Azure.

# DatabaseServerUnreacheble
source: An error has occurred while establishing a connection to the database server.
es: Se produjo un error al conectarse al servidor de la base de datos.
pt_br: Ocorreu um erro enquanto estabelecia conexão ao servidor de banco de dados.

# DataInputNotFound
source: Input for {0} not found.
es: Los datos de {0} no están completos.
pt_br: Dados para {0} não estão preenchidos

source: Deleted record.
es: Registro eliminado.
pt_br: Registro removido.

source: Expired password.
es: Contrasena caducada.
pt_br: Senha expirada.

# FailedToGenerateEmbed
source: Failed to generate embed token.
pt_br: No se pudo generar el token para el recurso.

# FieldMustBeInformed
source: Field {0} must be informed.
es: Se debe informar al campo {0}.
pt_br: Campo {0} deve ser informado.

# FileNotAllowed
source: File not allowed. Please use the following: {0}.
es: Archivo no permitido. ¡Solo se permiten {0}!
pt_br: Arquivo não permitido. Somente {0} são permitidos!

# Inactive
source: {0} inactive.
es: {0} inactivo
pt_br: {0} inativo

source: Invalid date argument.
pt_br: Argumento de fechas no válidas.

# InvalidField
source: Field {0} invalid.
es: El campo {0} no es válido.
pt_br: Campo {0} está inválido(a).

source: Invalid password.
es: Contraseña incorrecta.
pt_br: Senha incorreta.

source: Invalid token!
es: ¡Simbolo no valido!
pt_br: Token Inválido!

source: Invalid user or password.
es: El nombre de usuario o la contraseña no son válidos)
pt_br: Usuário ou senha inválido(s)

# IsNotPossibleToAddRLSWithoutExistingReport
source: Is not possible to add Role Level Security without existing report.
es: Não é possível adicionar Rol Nivel Seguridad sem relatório existente.
pt_br: Não é possível adicionar Role Level Security sem relatório existente.

# MustBeValidMailAddress
source: Must be a valid e-mail address.
es: Debe ser una dirección de correo electrónico válida.
pt_br: Deve ser um endereço de e-mail válido.

# NewPasswordMail
source: This e-mail has been sent by VOLVO. Please do not reply.<br /><br />Your new password is: <b>{0}</b>
es: Este correo electrónico fue enviado por Application. No responda. <br /> <br /> Su nueva contraseña es: <b> {0} </b>
pt_br: Este e-mail foi enviado pela Application. Por favor, não responda.<br /><br />Sua nova senha é: <b>{0}</b>

# NewPasswordSubject
source: New password for Volvo Labi System
es: Nueva contraseña para el sistema Generic App
pt_br: Nova senha para o sistema Generic App

# NoReportsInWorkspace
source: No reports were found in the workspace.
es: No se encontraron informes en el espacio de trabajo.
pt_br: Nenhum relatório foi encontrado no espaço de trabalho.

# NoReportWithGivenIdInWorkspace
source: No report with the given ID was found in the workspace. Make sure ReportId is valid.
es: No se encontraron informes en el espacio de trabajo con la ID ingresada. Compruebe si la identificación es válida.
pt_br: Nenhum relatório foi encontrado na área de trabalho com o ID inserido. Verifique se o ID é válido.

# NotAValidVigentPeriod
source: {0} doesn't have a valid vigent period.
es: {0} no tiene un término válido.
pt_br: {0} não tem período de vigência válido.

# NotCreated
source: {0} was not created.
es: {0} no se ingresó
pt_br: {0} não foi inserido(a)

# NotDeleted
source: {0} was not deleted.
es: ¡{0} no se eliminó!
pt_br: {0} não foi excluido(a)!

# NotFound
source: {0} was not found.
es: {0} no encontrado
pt_br: {0} não localizado

# NotUpdated
source: {0} was not updated.
es: {0} no se ha actualizado
pt_br: {0} não foi atualizado(a)

source: Object to be removed does not exists.
es: El objeto a remover no existe.
pt_br: Objeto a ser removido não existe.

source: Object to be updated does not exists.
es: El objeto a actualizar no existe.
pt_br: Objeto a ser atualizado não existe.

source: Password
es: Clave
pt_br: Senha

# PasswordMustBeBetween6And10
source: Password must have between 6 and 10 characters.
es: La contraseña debe contener entre 6 y 10 caracteres.
pt_br: A senha deve conter entre 6 e 10 caracteres

# PasswordMustContainLettersAndNumbers
source: The password must contain letters and numbers.
es: La contraseña debe contener letras y números.
pt_br: A senha deve conter letras e números.

# PasswordReseted
source: Password successfully reseted.
es: Contraseña restablecida correctamente.
pt_br: Senha resetada com sucesso.

# PasswordUpdated
source: Password successfully updated.
es: Contraseña alterada con éxito.
pt_br: Senha alterada com sucesso.

# PictureWithSizeAboveMaximum
source: Picture with size of {0} bytes. Maximum size allowed is {1} bytes!
es: Foto con un tamaño de {0} bytes y el tamaño máximo es de {1} bytes.
pt_br: Foto com tamanho {0} bytes e tamanho máxmimo é de {1} bytes!

source: Record created.
es: Grabación creada.
pt_br: Registro criado.

source: Record not found.
es: Registro no encontrado
pt_br: Registro não encontrado

source: Report
es: Reporte
pt_br: Relatório

source: Request could not be processed.
es: No se puede procesar la solicitud.
pt_br: A requisição não pode ser processada.

source: Response code not identified.
es: Código de respuesta no identificado.
pt_br: Código de resposta não identificado.

source: Successfully generated token.
es: Token generado con éxito.
pt_br: Token gerado com sucesso.

# TheFieldIsNotEqualTo
source: Field {0} not equal to informed {1}!
es: El campo {0} no coincide con el {1} ​​informado.
pt_br: O campo {0} não é correspondente ao {1} informado!

source: There is another record with same values.
es: Ya existe un registro con la misma información
pt_br: Já existe registro com as mesmas informações

# ThereIsARecordWithThis
source: There is already one {0} registered with this {1}!
es: ¡Ya hay un {0} registrado con este {1}!
pt_br: Já existe um(a) {0} cadastrado com este {1}!

# TypeMustBeSerializable
source: The type must be serializable.
es: El tipo debe ser serializable.
pt_br: O tipo deve ser serializavel.

source: Unauthorized access.
es: Acceso no autorizado.
pt_br: Acesso não autorizado.

# UnexpectedErrorTryAgain
source: There was an unexpected error, please try again.
es: Se produjo un error inesperado. Vuelva a intentarlo.
pt_br: Houve um erro inesperado, favor tentar novamente!

# UnexpectedFailureOccurred
source: An unexpected failure occurred.<br>Contact system administration.
es: Ocurrió una falla inesperada. <br> Comuníquese con la administración del sistema.
pt_br: Ocorreu uma falha inesperada.<br>Entre em contato com a administração do sistema.

source: Updated record.
es: Registro actualizado.
pt_br: Registro atualizado.

source: User
es: Usuario
pt_br: Usuário

# UserNotRegistered
source: User not registered. Please contact the system administration.
es: Usuario no registrado en el sistema. Solicite acceso de administrador.
pt_br: Usuário não cadastrado no sistema. Favor solicitar acesso ao administrador.

# ValueMustBeBetween
source: Value for {0} must be between {1} and {2}.
es: El valor de {0} debe estar entre {1} y {2}.
pt_br: O valor para {0} deve esta entre {1} a {2}
